In [1]:
import pandas as pd
import numpy as np

# The DataFrame Object

- Instantiating a DataFrame object from a dictionary and a numpy ndarray
- Importing a multidimensional dataset with the read_csv method
- Sorting one or more columns in a DataFrame
- Accessing rows and columns from a DataFrame
- Setting and resetting the index of a DataFrame
- Renaming column and index values

In [2]:
#Import the links for the datasets used
nba_url = "https://raw.githubusercontent.com/paskhaver/pandas-in-action/master/chapter_04_the_dataframe_object/nba.csv"
nfl_url = "https://raw.githubusercontent.com/paskhaver/pandas-in-action/master/chapter_04_the_dataframe_object/nfl.csv"

## Creating a DF from a dictionary

In [3]:
#First Create a dictionary, where the keys will be the features
#And the values will be observations
#For This example I will create a sample set of my favorite games

game_favorites = {
    "Title": ["Zelda","Paper Mario","Pokemon","Final Fantasy 7","Kingdom Hearts"],
    "Main Character": ["Link","Mario","Pikachu","Cloud","Sora"],
    "Rating": [5,4,4,4.5,5]
}
game_favorites_df = pd.DataFrame(game_favorites)
game_favorites_df

             Title Main Character  Rating
0            Zelda           Link     5.0
1      Paper Mario          Mario     4.0
2          Pokemon        Pikachu     4.0
3  Final Fantasy 7          Cloud     4.5
4   Kingdom Hearts           Sora     5.0

### Create a DataFrame from Numpy dArray

In [4]:
#First Create a ndarray with a shape of 3x5 
data = np.random.randint(1,101,[3,5])
data

array([[36, 49, 66, 17, 71],
       [88, 56,  6, 50, 17],
       [75, 92, 99, 10, 75]])

In [5]:
#Then pass it into pandas
pd.DataFrame(data=data)

    0   1   2   3   4
0  36  49  66  17  71
1  88  56   6  50  17
2  75  92  99  10  75

In [6]:
#Can edit/modify the index and columns by passing in values
index = ["Morning","Afternoon","Evening"]
columns = ["Monday","Tuesday","Wednesday","Thursday","Friday"]
temperatures = pd.DataFrame(data=data,
                            index=index,
                            columns=columns)
temperatures

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        36       49         66        17      71
Afternoon      88       56          6        50      17
Evening        75       92         99        10      75

In [7]:
#import the dataset for nfl into a dataframe
nba = pd.read_csv(nba_url)
nba.head()

             Name                Team Position Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG  9/26/96  1445697
1  Christian Wood     Detroit Pistons       PF  9/27/95  1645357
2   PJ Washington   Charlotte Hornets       PF  8/23/98  3831840
3    Derrick Rose     Detroit Pistons       PG  10/4/88  7317074
4   Marial Shayok  Philadelphia 76ers        G  7/26/95    79568

In [8]:
#There are dates in the table that are in string format
#Pass the parameter parse_dates=["Birthday"] to reformat to datetime
nba = pd.read_csv(nba_url, parse_dates=["Birthday"])
nba.head()

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [9]:
#Check the types within the dataframe
#strings are labelled as objects
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [10]:
#To preview values within the dataframe, each rows attributes, use property
nba.values

array([['Shake Milton', 'Philadelphia 76ers', 'SG',
        Timestamp('1996-09-26 00:00:00'), 1445697],
       ['Christian Wood', 'Detroit Pistons', 'PF',
        Timestamp('1995-09-27 00:00:00'), 1645357],
       ['PJ Washington', 'Charlotte Hornets', 'PF',
        Timestamp('1998-08-23 00:00:00'), 3831840],
       ...,
       ['Robin Lopez', 'Milwaukee Bucks', 'C',
        Timestamp('1988-04-01 00:00:00'), 4767000],
       ['Collin Sexton', 'Cleveland Cavaliers', 'PG',
        Timestamp('1999-01-04 00:00:00'), 4764960],
       ['Ricky Rubio', 'Phoenix Suns', 'PG',
        Timestamp('1990-10-21 00:00:00'), 16200000]], dtype=object)

In [11]:
#To examine the titles, or column headers use property
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [12]:
#To retrieve both the index values and columns use property
nba.axes

[RangeIndex(start=0, stop=450, step=1),
 Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')]

In [13]:
#To see how many rows of non-null values are in the dataframe use method
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [14]:
#To retrieve a sample of data, of a set size, use .sample(n)
nba.sample(5)

                Name                    Team Position   Birthday   Salary
319     Zach Collins  Portland Trail Blazers        C 1997-11-19  4240200
340   Carsen Edwards          Boston Celtics       SG 1998-03-12  1228026
0       Shake Milton      Philadelphia 76ers       SG 1996-09-26  1445697
306  Wayne Ellington         New York Knicks       SG 1987-11-29  8000000
344   Reggie Bullock         New York Knicks       SF 1991-03-16  4000000

In [15]:
#to retrieve the amount of unique values of each property, use .nunique()
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [16]:
#to retrieve rows with highest value of a certain attribute
#use method .nlargest(n,columns=column_name) 
#Where column_name is the column you want to find largest of
nba.nlargest(5,columns="Salary")

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [17]:
#Alternatively we can find smallest value, or oldest by using
# method .nsmallest(n,columns=column_name)
nba.nsmallest(5,"Birthday")

               Name               Team Position   Birthday    Salary
98     Vince Carter      Atlanta Hawks       PF 1977-01-26   2564753
196   Udonis Haslem         Miami Heat        C 1980-06-09   2564753
262     Kyle Korver    Milwaukee Bucks       PF 1981-03-17   6004753
149  Tyson Chandler    Houston Rockets        C 1982-10-02   2564753
415  Andre Iguodala  Memphis Grizzlies       SF 1984-01-28  17185185

In [18]:
#Can also use statistical methods similar to series
#When used on a dataframe it filters for numerical value columns
nba.mean()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  This is separate from the ipykernel package so we can avoid doing imports until

Salary    7.653584e+06
dtype: float64

### Sorting DataFrame

In [19]:
#To sort entire dataframe (temporarily) we call method .sort_values()
#Pass in the parameter by=column_name to sort by ascending order
#Pass in ascending=False to sort descending
nba.sort_values("Name")

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [20]:
#Can also sort by multiple columns by passing in list of columns
nba.sort_values(by = ["Name","Team"])

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [21]:
#Can also sort inplace, which mutates original dataframe
#however we can 'reset' it by resorting it by index
nba.sort_index()

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [22]:
#Sort_index can sort either the columns or rows by passing in parameter 
#to indicate which axes, 0 for rows and 1 for columns
nba.sort_index(axis = 1, ascending = False)

                    Team    Salary Position            Name   Birthday
0     Philadelphia 76ers   1445697       SG    Shake Milton 1996-09-26
1        Detroit Pistons   1645357       PF  Christian Wood 1995-09-27
2      Charlotte Hornets   3831840       PF   PJ Washington 1998-08-23
3        Detroit Pistons   7317074       PG    Derrick Rose 1988-10-04
4     Philadelphia 76ers     79568        G   Marial Shayok 1995-07-26
..                   ...       ...      ...             ...        ...
445      Houston Rockets   2174310       PG   Austin Rivers 1992-08-01
446     Sacramento Kings   2578800       PF     Harry Giles 1998-04-22
447      Milwaukee Bucks   4767000        C     Robin Lopez 1988-04-01
448  Cleveland Cavaliers   4764960       PG   Collin Sexton 1999-01-04
449         Phoenix Suns  16200000       PG     Ricky Rubio 1990-10-21

[450 rows x 5 columns]

In [23]:
#Can reset the index to be one of the included columns
#Choosing one that makes sense and is usually unique values helps organize
nba.set_index("Name",inplace=True)
nba.head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

### Selecting Columns or Rows from a DataFrame

In [24]:
#To Select Columns from a dataframe use either property with column name
#or use Brackets with column names
nba_salary = nba.Salary
nba_salary2 = nba["Salary"]

#for Multiple use brackects
nba_salaary_birthday = nba[["Birthday","Salary"]]

In [26]:
#To select rows, use .iloc() or .loc[] methods
#The .iloc[] method is based on the index row label, and in this it is the name
nba.loc["LeBron James"]

Team         Los Angeles Lakers
Position                     PF
Birthday    1984-12-30 00:00:00
Salary                 37436858
Name: LeBron James, dtype: object

In [32]:
#Can Also pass multiple names and it will return dataframe
nba.loc[["Kawhi Leonard","LeBron James"]]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
LeBron James     Los Angeles Lakers       PF 1984-12-30  37436858

In [34]:
#Can Also slice index ranges
#And to select a range in alphabetical order, use method
nba.sort_index().loc["Otto Porter":"Patrick Beverley"]

                                  Team Position   Birthday    Salary
Name
Otto Porter              Chicago Bulls       SF 1993-06-03  27250576
PJ Dozier               Denver Nuggets       PG 1996-10-25     79568
PJ Washington        Charlotte Hornets       PF 1998-08-23   3831840
Pascal Siakam          Toronto Raptors       PF 1994-04-02   2351838
Pat Connaughton        Milwaukee Bucks       SG 1993-01-06   1723050
Patrick Beverley  Los Angeles Clippers       PG 1988-07-12  12345680

In [35]:
#The .iloc() method (index location) is used for searching by position
nba.iloc[300]

Team             Denver Nuggets
Position                     PF
Birthday    1999-04-03 00:00:00
Salary                  1416852
Name: Jarred Vanderbilt, dtype: object

In [36]:
#using multiple positions returns a dataframe
nba.iloc[[100,105,120,150]]

                            Team Position   Birthday    Salary
Name
Brian Bowen       Indiana Pacers       SG 1998-10-02     79568
John Konchar   Memphis Grizzlies       SG 1996-03-22     79568
DeMar DeRozan  San Antonio Spurs       SF 1989-08-07  27739975
Solomon Hill   Memphis Grizzlies       SF 1991-03-18  13290395

In [38]:
#Can also slice with index positions
#Use negative numbers to retrieve end of the dataset
nba.iloc[100:110]

                                   Team Position   Birthday    Salary
Name
Brian Bowen              Indiana Pacers       SG 1998-10-02     79568
Aaron Holiday            Indiana Pacers       PG 1996-09-30   2239200
Troy Daniels         Los Angeles Lakers       SG 1991-07-15   2028594
Buddy Hield            Sacramento Kings       SG 1992-12-17   4861207
Terance Mann       Los Angeles Clippers       SG 1996-10-18   1000000
John Konchar          Memphis Grizzlies       SG 1996-03-22     79568
KZ Okpala                    Miami Heat       SF 1999-04-28    898310
Denzel Valentine          Chicago Bulls       SF 1993-11-16   3377568
Marquese Chriss   Golden State Warriors       PF 1997-07-02   1678854
Anthony Davis        Los Angeles Lakers        C 1993-03-11  27093019

In [39]:
#To extract a specific value of an attribute use the .loc[]
#df.loc[index,column_name]
nba.loc["Giannis Antetokounmpo", "Team"]

'Milwaukee Bucks'

In [41]:
#columns also have index position and can be used to specify search
#use nba.columns to identify the positions 
#then use .iloc[row_index,column_index]

#Column index 3 is salary therefore
nba.iloc[50,3]

1416852

In [43]:
#Alternatives to .iloc[] and .loc[]  are 
# .at[] and .iat[]
#which are used to extract a single value (rather than lists or series)
#These methods are often more efficient than the .iloc and .loc versions
#All these methods can be used on series as well

nba["Salary"].iloc[50]

1416852

In [44]:
nba["Salary"].iat[50]

1416852

### Renaming Columns and Rows

In [51]:
#To rename a column, first identify the size of list needed and match up index position of new name
nba.columns

Index(['Team', 'Position', 'DoB', 'Salary'], dtype='object')

In [55]:
nba.columns = ["Team","Position", "DoB", "Salary"]
nba.columns

Index(['Team', 'Position', 'DoB', 'Salary'], dtype='object')

In [57]:
#Alternatively, can specifiy the exact column with .rename()
#make sure to pass inplace=True if you want to modify the original"
nba.rename(columns={"DoB": "Birthday"}, inplace=True)
nba.columns

Index(['Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [59]:
#Can also use the .rename() on index labels
nba.rename(index={"LeBron James":"Big Boi"},inplace=True)
nba.loc["Big Boi"]

Team         Los Angeles Lakers
Position                     PF
Birthday    1984-12-30 00:00:00
Salary                 37436858
Name: Big Boi, dtype: object

In [61]:
#To Reset the index and replace it with a different index
#use .reset_index() combined with .set_index()
nba.reset_index().set_index("Team").head()

                              Name Position   Birthday   Salary
Team
Philadelphia 76ers    Shake Milton       SG 1996-09-26  1445697
Detroit Pistons     Christian Wood       PF 1995-09-27  1645357
Charlotte Hornets    PJ Washington       PF 1998-08-23  3831840
Detroit Pistons       Derrick Rose       PG 1988-10-04  7317074
Philadelphia 76ers   Marial Shayok        G 1995-07-26    79568

In [63]:
#However the chain methods doesn't modify original dataframe
#Have to reset it in individual lines
nba.reset_index(inplace=True)
nba.set_index("Name",inplace=True)
nba.head(5)

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568